// #include<stdio.h>
// int main()
// {
//     for(int i=8;i<=200;i=i+8)
//     {
//         printf("%d\n",i);
//     }
//     return 0;
// }


// #include<stdio.h>
// int main()
// {  
//     for(int i=100;i>=1;i--)
//     {   if(i%2 !=0)
//         {
//             printf("%d\n",i); 
//         }
//     }
   
//     return 0;
// }


// Difference between break and continue (Paragraph Form):

// C প্রোগ্রামিংয়ে break এবং continue — দুটোই লুপ নিয়ন্ত্রণের জন্য ব্যবহৃত হয়, কিন্তু এদের কাজ একে অপরের থেকে আলাদা।

// break স্টেটমেন্টের কাজ হলো কোনো লুপের ভেতরে নির্দিষ্ট শর্ত পূরণ হলে পুরো লুপটি সম্পূর্ণভাবে বন্ধ করে দেওয়া। অর্থাৎ, break লেখা অংশে পৌঁছামাত্র লুপের বাকি অংশ আর চালানো হয় না, প্রোগ্রাম সরাসরি লুপের বাইরে চলে যায়। এটি সাধারণত তখন ব্যবহার করা হয় যখন কোনো বিশেষ শর্তে লুপ থামিয়ে দিতে হয়, যেমন ইনপুট পাওয়া বা কোনো ভুল ধরা পড়লে লুপ বন্ধ করা।

// অন্যদিকে, continue স্টেটমেন্ট লুপের ভেতরে থাকলেও লুপ বন্ধ করে না, বরং চলতি iteration টা বাদ দিয়ে পরের iteration-এ চলে যায়। অর্থাৎ, যেখানে continue লেখা থাকে, তার পরের কোড আর এক্সিকিউট হয় না, বরং লুপের শর্তে ফিরে গিয়ে আবার চেক করে নতুন করে লুপ চালু হয়। এটি সাধারণত তখন ব্যবহার করা হয় যখন কোনো নির্দিষ্ট অবস্থায় লুপের কিছু অংশ স্কিপ করতে হয় কিন্তু লুপ চালু রাখতে হয়।

// সহজভাবে বলতে গেলে — break লুপ থামায়, আর continue লুপ চালিয়ে যায় কিন্তু একটি ধাপ বাদ দিয়ে।